# Прикрутить телеграмм бота к задачам с предыдущего семинара:

# Условие задачи: На столе лежит 221 конфета. Играют два игрока делая ход друг после друга.
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.
# Все конфеты оппонента достаются сделавшему последний ход.

#     Добавьте игру против бота ( где бот берет рандомное количество конфет от 0 до 28)

#     Подумайте как наделить бота ""интеллектом""
# (есть алгоритм, позволяющий выяснить какое количесвто конфет необходимо брать, чтобы гарантированно победить, 
# соответственно внедрить этот алгоритм боту )